In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Find Shape of Dataset

In [3]:
df1.shape

(7, 3)

In [4]:
print('Number of Rows:', df1.shape[0])
print('Number of Columns:', df1.shape[1])

Number of Rows: 7
Number of Columns: 3

## Get information About Out Dataset

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

## Check Null Values in The Dataset

In [6]:
df1.isnull().sum(axis = 0)

Name      0
Marks     0
Gender    0
dtype: int64

## Get Overall Statistics About The Dataframe

In [7]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

## Find Unique Values From The Gender Column

In [8]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [9]:
gender = df1['Gender'].unique()

In [10]:
print(gender[0])
print(gender[1])
for i in gender:
    print(i)

Male
Female
Male
Female

In [11]:
df1['Gender'].nunique()

2

## Display Count of Unique Values In Gender Column

In [12]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [13]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)])

4

In [14]:
sum(df1['Marks'].between(90, 100))

4

## Average Marks

In [15]:
df1['Marks'].mean()

92.14285714285714

In [16]:
df1['Marks'].max()

99

## Apply method

In [17]:
def marks(x):
    return x/2

In [18]:
df1['Half_marks'] = df1['Marks'].apply(marks)

In [19]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [20]:
df1[[1, 2]] = df1[['Marks','Half_marks']].apply(lambda x: x/2)

In [21]:
df1

      Name  Marks  Gender  Half_marks     1      2
0  Priyang     98    Male        49.0  49.0  24.50
1   Aadhya     89  Female        44.5  44.5  22.25
2   Krisha     99  Female        49.5  49.5  24.75
3   Vedant     87    Male        43.5  43.5  21.75
4   Parshv     90    Male        45.0  45.0  22.50
5   Mittal     83  Female        41.5  41.5  20.75
6  Archana     99  Female        49.5  49.5  24.75

In [22]:
df1

      Name  Marks  Gender  Half_marks     1      2
0  Priyang     98    Male        49.0  49.0  24.50
1   Aadhya     89  Female        44.5  44.5  22.25
2   Krisha     99  Female        49.5  49.5  24.75
3   Vedant     87    Male        43.5  43.5  21.75
4   Parshv     90    Male        45.0  45.0  22.50
5   Mittal     83  Female        41.5  41.5  20.75
6  Archana     99  Female        49.5  49.5  24.75

In [23]:
# apply method to find the len of values
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## Map Function

In [24]:
df1['M_F'] = df1['Gender'].map({'Male' : 1, 'Female': 0})

In [25]:
df1

      Name  Marks  Gender  Half_marks     1      2  M_F
0  Priyang     98    Male        49.0  49.0  24.50    1
1   Aadhya     89  Female        44.5  44.5  22.25    0
2   Krisha     99  Female        49.5  49.5  24.75    0
3   Vedant     87    Male        43.5  43.5  21.75    1
4   Parshv     90    Male        45.0  45.0  22.50    1
5   Mittal     83  Female        41.5  41.5  20.75    0
6  Archana     99  Female        49.5  49.5  24.75    0

## Drop the columns

In [26]:
df1.drop('M_F', axis = 1)

      Name  Marks  Gender  Half_marks     1      2
0  Priyang     98    Male        49.0  49.0  24.50
1   Aadhya     89  Female        44.5  44.5  22.25
2   Krisha     99  Female        49.5  49.5  24.75
3   Vedant     87    Male        43.5  43.5  21.75
4   Parshv     90    Male        45.0  45.0  22.50
5   Mittal     83  Female        41.5  41.5  20.75
6  Archana     99  Female        49.5  49.5  24.75

In [37]:
df1.drop(columns =[1, 2], axis = 1, inplace = True)

In [28]:
df1

      Name  Marks  Gender     1      2
0  Priyang     98    Male  49.0  24.50
1   Aadhya     89  Female  44.5  22.25
2   Krisha     99  Female  49.5  24.75
3   Vedant     87    Male  43.5  21.75
4   Parshv     90    Male  45.0  22.50
5   Mittal     83  Female  41.5  20.75
6  Archana     99  Female  49.5  24.75

## Print Name of the Columns

In [29]:
df1.columns

Index(['Name', 'Marks', 'Gender', 1, 2], dtype='object')

In [30]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## Sort the Dataframe As Per The Marks Column

In [31]:
df1['Marks'].sort_values(ascending = False)

2    99
6    99
0    98
4    90
1    89
3    87
5    83
Name: Marks, dtype: int64

In [39]:
df1.sort_values(by= ['Marks'], ascending = False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## Display Name & Marks of The Female Students

In [48]:
df1[df1['Gender'] == 'Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [54]:
df1[df1['Gender'] == 'Female'][['Name']]

1     Aadhya
2     Krisha
5     Mittal
6    Archana
Name: Name, dtype: object

In [47]:
df1[df1['Gender'].str.lower() == 'female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [44]:
df1[df1['Gender'].str[0] == 'F']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [63]:
df1.loc[0:2]

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [62]:
df1.iloc[0:2]

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female